The Roof or Floor may only contain straight lines.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId SlabShapeFailedNotOnlyLines { get; }
  Visual Basic
Public Shared ReadOnly Property SlabShapeFailedNotOnlyLines As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SlabShapeFailedNotOnlyLines {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SlabShapeFailures Class
  Autodesk.Revit.DB Namespace